0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            noSlip;
    }
    outlet_left
    {
        type            zeroGradient;
    }
    outlet_right
    {
        type            zeroGradient;
    }
    outlet_topBottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
