0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet_left
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }


    outlet_right
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    outlet_topBottom
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    nozzle
    {
        type omegaWallFunction;
        value uniform 1;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //