0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 150000;
    }
    nozzle
    {
        type            zeroGradient;
    }
    outlet_left
    {
        type            waveTransmissive;
        field           p;
        psi             psi;
        gamma           1.3;
        fieldInf        101325;
        lInf            1;
        value           uniform 101325;
    }
    outlet_right
    {
         type            waveTransmissive;
        field           p;
        psi             psi;
        gamma           1.3;
        fieldInf        101325;
        lInf            1;
        value           uniform 101325;
    }
    outlet_topBottom
    {
        type            waveTransmissive;
        field           p;
        psi             psi;
        gamma           1.3;
        fieldInf        101325;
        lInf            1;
        value           uniform 101325;
    }
}


// ************************************************************************* //
