Allrun
# All run script for case

./Allmesh 
./Allsolve
