system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12                                 	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho 75;
maxBoundarySkewness 20;	//Original 20 for better quality 4
maxInternalSkewness 3;

//- Maximum non-orthogonality allowed. Set to 180 to disable.
//- Max skewness allowed. Set to <0 to disable.
/*
maxNonOrtho 180;
maxBoundarySkewness -1;	
maxInternalSkewness -1;
*/

//Face concavity check of the interior angles making up the face
maxConcave 80;	//80


//  Set to very negative number (e.g. -1E30) to disable.
//minVol 1e-13;
minVol -1e30;


//- Minimum quality of the tet formed by the face-centre
//  and variable base point minimum decomposition triangles and
//  the cell centre. Set to very negative number (e.g. -1E30) to
//  disable.
//     <0 = inside out tet,
//      0 = flat tet
//      1 = regular tet
//  1e-15 (small positive) to enable tracking
// -1e+30 (large negative) for best layer insertion
//minTetQuality 1e-15;
minTetQuality -1e+30;


minTwist 0.02;  //0.01;

minDeterminant 0.001;	//0.001

minFaceWeight 0.05;

minVolRatio 0.01;

// ************************************************************************* //
